backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def current_user
        if decode_token
            user_id = decode_token[0]['user_id']
            @user = User.find_by_id(id: user_id)