backend/app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Jason"], ["LIMIT", 1]]
---
    def create
        user = User.find_by(name: params[:name])

SELECT "workout_sessions".* FROM "workout_sessions" WHERE "workout_sessions"."user_id" = ?  [["user_id", 10]]
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ?  [["user_id", 1]]
---
    def profile
        render json: {user: @user, workout_sessions: @user.workout_sessions.map {|ws| WorkoutSessionSerializer.new(ws) }}