backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        user = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        user = User.find_by(id: params[:id])

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "John"], ["password_digest", "$2a$12$AGIlJw89FhbDwkwCB14vFudlf4nmbO9S0HJXGFdQ6V3DmhM.SvsuG"], ["created_at", "2021-04-02 15:19:51.223903"], ["updated_at", "2021-04-02 15:19:51.223903"]]
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Chett"], ["password_digest", "$2a$12$qAAuqHFEL25sW.bLQHyUKeWLC8OJzrZAiUPxmO.eqOb8tvVbRIqFu"], ["created_at", "2021-04-01 22:08:29.912130"], ["updated_at", "2021-04-01 22:08:29.912130"]]
---
    def create
       user = User.create(user_params)
       if user.save