backend/app/controllers/workout_sessions_controller.rb

    def index
        ws = WorkoutSession.all
---
SELECT "workout_sessions".* FROM "workout_sessions"

    def show
        ws = @user.workout_sessions.find_by(id: params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."workout_session_id" = ?  [["workout_session_id", 4]]