backend/app/controllers/workouts_controller.rb

    def show
        @user = User.find_by(id: params[:user_id])
        @workout = @user.workouts.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ? AND "workouts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

    def create
       @workout = @user.workouts.build(workout_params)
       if @user.valid? && @workout.save
---
INSERT INTO "workouts" ("name", "weight", "reps", "sets", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Push-ups"], ["weight", 20], ["reps", 10], ["sets", 3], ["user_id", 1], ["created_at", "2021-03-31 15:22:55.621934"], ["updated_at", "2021-03-31 15:22:55.621934"]]

    def destroy
        @workout = Workout.find_by(id: params[:id])
        @workout.destroy
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 1]]

    def find_user
        @user = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]