backend/app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"
---
    def index
        if params[:workout_session_id]
            @workouts = @ws.workouts
        else
            @workouts = Workout.all

SELECT "workout_sessions".* FROM "workout_sessions" WHERE "workout_sessions"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def find_workout_session
        @ws = WorkoutSession.find_by(id: params[:workout_session_id])